app/controllers/users_controller.rb

  def index
    @users = User.all.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.where(id: params[:id]).take
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1
SELECT  "microposts".* FROM "microposts"  WHERE "microposts"."user_id" = ?  ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 14]]
SELECT  "users".* FROM "users"  WHERE (1) LIMIT 1
SELECT COUNT(*) FROM "microposts"  WHERE "microposts"."user_id" = ?  [["user_id", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("activation_digest", "created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
     @user = User.where(id: params[:id]).take
---
SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1

  def update
    @user = User.where(id: params[:id]).take
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "Sumit pal"], ["password_digest", "$2a$10$UDzE7g3xuRFOnW13bsHqKejnzLkjPuuQRVWjcB3NC//02oARf3Xy."], ["updated_at", "2014-11-26 12:35:56.022942"]]

  def destroy
   User.where(id: params[:id]).take.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1